/**
 *****************************************
 * Created by lifx
 * Created on 2018-04-09 20:04:27
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载模块
 *****************************************
 */
import flow from '../lib/flow';


/**
 *****************************************
 * 测试模块
 *****************************************
 */
describe('测试【flow】', () => {
    test('测试组合函数', () => {
        let fn1 = jest.fn((...args) => Math.max(...args)),
            fn2 = jest.fn(x => x * 2),
            cb = flow(fn1, fn2);

        // 校验结果
        expect(cb(1, 5, 2, 4)).toBe(10);
        expect(fn1.mock.calls).toEqual([[1, 5, 2, 4]]);
        expect(fn2.mock.calls).toEqual([[5]]);
    });
});
